dobova86/TinyCLR_Port/Targets/STM32H7xx/STM32H7_USBC.cpp
typedef struct {
    USB_CONTROLLER_STATE* usbState;

    uint8_t     previousDeviceState;
    uint16_t    endpointType;

} STM32H7_UsbClientController;


static const STM32H7_Gpio_Pin g_STM32H7_Usb_Dm_Pins[] = STM32H7_USB_DM_PINS;
static const STM32H7_Gpio_Pin g_STM32H7_Usb_Dp_Pins[] = STM32H7_USB_DP_PINS;
static const STM32H7_Gpio_Pin g_STM32H7_Usb_Vb_Pins[] = STM32H7_USB_VB_PINS;
static const STM32H7_Gpio_Pin g_STM32H7_Usb_Id_Pins[] = STM32H7_USB_ID_PINS;

void STM32H7_UsbClient_ProtectPins(int32_t controller, bool On);
void STM32H7_UsbClient_Interrupt(void* param);

#ifdef OTG_USE_HS_ULPI
bool STM32H7_UsbClient_ProtectUlpiPins(int32_t controller, bool On);
static const STM32H7_Gpio_Pin g_STM32H7_Usb_Ulpi_Pins[] = STM32H7_USB_ULPI_PINS;
static const int TOTAL_ULPI_PINS = SIZEOF_ARRAY(g_STM32H7_Usb_Ulpi_Pins);
#endif

static const int TOTAL_USB_CONTROLLERS = STM32H7_TOTAL_USB_CONTROLLERS;


/* usbState variables for the controllers */
static STM32H7_UsbClientController usbClientController[STM32H7_TOTAL_USB_CONTROLLERS];

const TinyCLR_Api_Info* STM32H7_UsbClient_GetApi() {

    return TinyCLR_UsbClient_GetApi();
}

void STM32H7_UsbClient_Reset() {
    return TinyCLR_UsbClient_Reset(STM32H7_USB_FS_ID);
}

void STM32H7_UsbClient_InitializeConfiguration(USB_CONTROLLER_STATE *usbState) {
    int32_t controller = STM32H7_USB_FS_ID;

	if (usbState != nullptr) {
        usbState->controllerNum = controller;

        usbState->maxFifoPacketCount = STM32H7_USB_PACKET_FIFO_COUNT;
        usbState->totalEndpointsCount = STM32H7_USB_ENDPOINT_COUNT;
        usbState->totalPipesCount = STM32H7_USB_PIPE_COUNT;

        usbClientController[controller].usbState = usbState;

        usbClientController[controller].endpointType = 0;
        for (auto i = 0; i < usbClientController[controller].usbState->deviceDescriptor.Configurations->Interfaces->EndpointCount; i++) {
            TinyCLR_UsbClient_EndpointDescriptor  *ep = (TinyCLR_UsbClient_EndpointDescriptor*)&usbClientController[controller].usbState->deviceDescriptor.Configurations->Interfaces->Endpoints[i];

            auto idx = ep->Address & 0x0F;

            usbClientController[controller].endpointType |= (ep->Attributes & 3) << (idx * 2);
        }
    }
}

bool STM32H7_UsbClient_Initialize(USB_CONTROLLER_STATE* usbState) {

    if (usbState == nullptr)
        return false;

    int32_t controller = usbState->controllerNum;

    //auto& dp = g_STM32H7_Usb_Dp_Pins[controller];
    //auto& dm = g_STM32H7_Usb_Dm_Pins[controller];
    //auto& id = g_STM32H7_Usb_Id_Pins[controller];

    //if (!STM32H7_GpioInternal_OpenPin(dp.number) || !STM32H7_GpioInternal_OpenPin(dm.number))
    //    return false;

    //if (STM32H7_USB_USE_ID_PIN(controller) && !STM32H7_GpioInternal_OpenPin(id.number))
    //    return false;
#ifndef OTG_USE_HS_ULPI
	auto& dp = g_STM32H7_Usb_Dp_Pins[controller];
	auto& dm = g_STM32H7_Usb_Dm_Pins[controller];
	auto& id = g_STM32H7_Usb_Id_Pins[controller];

	if (!STM32H7_GpioInternal_OpenPin(dp.number) || !STM32H7_GpioInternal_OpenPin(dm.number))
		return false;

	if (STM32H7_USB_USE_ID_PIN(controller) && !STM32H7_GpioInternal_OpenPin(id.number))
		return false;
#endif

    // Enable USB clock
    // FS on AHB2
    //RCC->AHB2ENR |= RCC_AHB2ENR_OTGFSEN;

#ifdef OTG_USE_HS
	RCC->AHB1ENR |= RCC_AHB1ENR_OTGHSEN;
	RCC->AHB1LPENR |= RCC_AHB1LPENR_OTGHSLPEN;
	// this is needed to enable the FS phy clock when the CPU is sleeping
#ifdef OTG_USE_HS_ULPI
	RCC->AHB1ENR |= RCC_AHB1ENR_OTGHSULPIEN;
//#else
//	RCC->AHB1ENR &= ~RCC_AHB1ENR_OTGHSULPIEN;
#endif //OTG_USE_HS_ULPI
#else 
	RCC->AHB2ENR |= RCC_AHB2ENR_OTGFSEN;
	//auto rcc = RCC->AHB2ENR | RCC_AHB2ENR_OTGFSEN_Msk;
	RCC->AHB2LPENR |= RCC_AHB2LPENR_OTGFSLPEN;
#endif //OTG_USE_HS

	RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;

    OTG_TypeDef* OTG = OTG_FS;

    DISABLE_INTERRUPTS_SCOPED(irq);

    // Detach usb port for a while to enforce re-initialization
    OTG->DCTL = OTG_DCTL_SDIS; // soft disconnect

    OTG->GAHBCFG = OTG_GAHBCFG_TXFELVL;     // int32_t on TxFifo completely empty, int32_t off

#ifdef OTG_USE_HS_ULPI
	OTG->GCCFG &= ~(OTG_GCCFG_PWRDWN); // transceiver disabled external ULPI
	OTG->GUSBCFG &= ~(USB_OTG_GUSBCFG_TSDPS | USB_OTG_GUSBCFG_ULPIFSLS | USB_OTG_GUSBCFG_PHYSEL);

	OTG->GUSBCFG = OTG_GUSBCFG_FDMOD        // force device mode
		| STM32H7_USB_TRDT << 10			// turnaround time
		| 1 << 4;							// Use ULPI

		//OTG->DCFG = 0; // high speed
#else

    OTG->GUSBCFG = OTG_GUSBCFG_FDMOD        // force device mode
        | STM32H7_USB_TRDT << 10   // turnaround time
        | OTG_GUSBCFG_PHYSEL      // internal PHY
		| OTG_GUSBCFG_PHYLPCS;

    OTG->GCCFG |= OTG_GCCFG_PWRDWN;        // transceiver enabled
    OTG->DCFG |= OTG_DCFG_DSPD;           // device speed = HS
#endif
    if (STM32H7_USB_USE_VB_PIN(controller) == 0) { // no Vbus pin
        OTG->GCCFG |= OTG_GCCFG_NOVBUSSENS; // disable vbus sense
    }

    STM32H7_Time_Delay(nullptr, 1000); // asure host recognizes reattach

    // setup hardware
    //STM32H7_UsbClient_ProtectPins(controller, true);
#ifdef OTG_USE_HS_ULPI
	STM32H7_UsbClient_ProtectUlpiPins(controller, true);
#else
	STM32H7_UsbClient_ProtectPins(controller, true);
#endif

    //STM32H7_InterruptInternal_Activate(OTG_FS_IRQn, (uint32_t*)&STM32H7_UsbClient_Interrupt, 0);
    //STM32H7_InterruptInternal_Activate(OTG_FS_WKUP_IRQn, (uint32_t*)&STM32H7_UsbClient_Interrupt, 0);
#ifdef OTG_USE_HS
	STM32H7_InterruptInternal_Activate(OTG_HS_IRQn, (uint32_t*)&STM32H7_UsbClient_Interrupt, 0);
	STM32H7_InterruptInternal_Activate(OTG_HS_WKUP_IRQn, (uint32_t*)&STM32H7_UsbClient_Interrupt, 0);
#else
	STM32H7_InterruptInternal_Activate(OTG_FS_IRQn, (uint32_t*)&STM32H7_UsbClient_Interrupt, 0);
	STM32H7_InterruptInternal_Activate(OTG_FS_WKUP_IRQn, (uint32_t*)&STM32H7_UsbClient_Interrupt, 0);
#endif

    // allow interrupts
    OTG->GINTSTS = 0xFFFFFFFF;           // clear all interrupts
    OTG->GINTMSK = OTG_GINTMSK_USBRST;   // enable reset only
    OTG->DIEPEMPMSK = 0;                 // disable Tx FIFO empty interrupts
    OTG->GAHBCFG |= OTG_GAHBCFG_GINTMSK; // gloabl interrupt enable

    OTG->GOTGCTL |= USB_OTG_GOTGCTL_BVALOEN | USB_OTG_GOTGCTL_BVALOVAL;

	//STM32H7_DebugLed(PIN(I,1), true);

