dobova86/TinyCLR_Port/Targets/STM32H7xx/STM32H7_USBC.cpp
            // write data
            uint32_t volatile* pd = OTG->DFIFO[ep];
            for (int32_t c = count; c > 0; c -= 4) {
                *pd = *ps++;
            }
        }
        else { // no data
            // disable endpoint
            OTG->DIEP[ep].CTL |= OTG_DIEPCTL_SNAK;
        }
    }
}

void STM32H7_UsbClient_HandleSetup(OTG_TypeDef* OTG, USB_CONTROLLER_STATE* usbState) {
    /* send last setup packet to the upper layer */
    uint8_t result = TinyCLR_UsbClient_ControlCallback(usbState);

    switch (result) {

    case USB_STATE_ADDRESS:
        /* upper layer needs us to change the address */
        OTG->DCFG |= usbState->address << 4; // set device address
        break;

    case USB_STATE_DONE:
        usbState->dataCallback = 0;
        break;

    case USB_STATE_STALL:
        // setup packet failed to process successfully
        // set stall condition on the control endpoint
        OTG->DIEP[0].CTL |= OTG_DIEPCTL_STALL;
        OTG->DOEP[0].CTL |= OTG_DOEPCTL_STALL;

        // ********** skip rest of function **********
        return;
    }

    // check ep0 for replies
    STM32H7_UsbClient_EndpointInInterrupt(OTG, usbState, 0);

    // check all Tx endpoints after configuration setup
    if (result == USB_STATE_CONFIGURATION) {
        for (int32_t ep = 1; ep < usbState->totalEndpointsCount; ep++) {
            if (usbState->queues[ep] && usbState->isTxQueue[ep]) {
                STM32H7_UsbClient_EndpointInInterrupt(OTG, usbState, ep);
            }
        }
    }
}

void STM32H7_UsbClient_EndpointOutInterrupt(OTG_TypeDef* OTG, USB_CONTROLLER_STATE* usbState, uint32_t ep) {
    uint32_t bits = OTG->DOEP[ep].INT;
    if (bits & OTG_DOEPINT_XFRC) { // transfer completed
        OTG->DOEP[ep].INT = OTG_DOEPINT_XFRC; // clear interrupt
    }

    if (bits & OTG_DOEPINT_STUP) { // setup phase done
        OTG->DOEP[ep].INT = OTG_DOEPINT_STUP; // clear interrupt
    }

    if (ep == 0) { // control endpoint
        // enable endpoint
        OTG->DOEP[0].TSIZ = OTG_DOEPTSIZ_STUPCNT | OTG_DOEPTSIZ_PKTCNT_1 | usbState->maxEndpointsPacketSize[0];
        OTG->DOEP[0].CTL |= OTG_DOEPCTL_EPENA | OTG_DOEPCTL_CNAK;
        // Handle Setup data in upper layer
        STM32H7_UsbClient_HandleSetup(OTG, usbState);
    }
    else if (TinyCLR_UsbClient_CanReceivePackage(usbState, ep)) {
        // enable endpoint
        OTG->DOEP[ep].TSIZ = OTG_DOEPTSIZ_PKTCNT_1 | usbState->maxEndpointsPacketSize[ep];
        OTG->DOEP[ep].CTL |= OTG_DOEPCTL_EPENA | OTG_DOEPCTL_CNAK;
    }
    else {
        // disable endpoint
        OTG->DOEP[ep].CTL |= OTG_DOEPCTL_SNAK;
    }
}

void STM32H7_UsbClient_Interrupt(void* param) {
    INTERRUPT_STARTED_SCOPED(isr);

    DISABLE_INTERRUPTS_SCOPED(irq);

    OTG_TypeDef* OTG = OTG_FS;

    int32_t controller = STM32H7_USB_FS_ID;

    USB_CONTROLLER_STATE* usbState = usbClientController[controller].usbState;

    uint32_t intPend = OTG->GINTSTS; // get pending bits

    while (intPend & OTG_GINTSTS_RXFLVL) { // RxFifo non empty
        uint32_t status = OTG->GRXSTSP; // read and pop status word from fifo
        int32_t ep = status & OTG_GRXSTSP_EPNUM;
        int32_t count = (status & OTG_GRXSTSP_BCNT) >> 4;
        status &= OTG_GRXSTSP_PKTSTS;
        if (status == OTG_GRXSTSP_PKTSTS_PR // data received
            || status == OTG_GRXSTSP_PKTSTS_SR // setup received
            ) {
            STM32H7_UsbClient_EndpointRxInterrupt(OTG, usbState, ep, count);
        }
        else {
            // others: nothing to do
        }
        intPend = OTG->GINTSTS; // update pending bits
    }

    if (intPend & OTG_GINTSTS_IEPINT) { // IN endpoint
        uint32_t bits = OTG->DAINT & 0xFFFF; // pending IN endpoints
        int32_t ep = 0;
        while (bits) {
            if (bits & 1)
                STM32H7_UsbClient_EndpointInInterrupt(OTG, usbState, ep);
            ep++;
            bits >>= 1;
        }
    }

    if (intPend & OTG_GINTSTS_OEPINT) { // OUT endpoint
        uint32_t bits = OTG->DAINT >> 16; // pending OUT endpoints
        int32_t ep = 0;
        while (bits) {
            if (bits & 1)
                STM32H7_UsbClient_EndpointOutInterrupt(OTG, usbState, ep);

            ep++;
            bits >>= 1;
        }
    }

    if (intPend & OTG_GINTSTS_USBRST) { // reset
        STM32H7_UsbClient_ResetEvent(OTG, usbState);
        OTG->GINTSTS = OTG_GINTSTS_USBRST; // clear interrupt
    }
    else {
        if (intPend & OTG_GINTSTS_USBSUSP) { // suspend
            usbClientController[controller].previousDeviceState = usbState->deviceState;

            usbState->deviceState = USB_DEVICE_STATE_SUSPENDED;

            TinyCLR_UsbClient_StateCallback(usbState);

            OTG->GINTSTS = OTG_GINTSTS_USBSUSP; // clear interrupt
        }

        if (intPend & OTG_GINTSTS_WKUPINT) { // wakeup
            OTG->DCTL &= ~OTG_DCTL_RWUSIG; // remove remote wakeup signaling

            usbState->deviceState = usbClientController[controller].previousDeviceState;

            TinyCLR_UsbClient_StateCallback(usbState);

            OTG->GINTSTS = OTG_GINTSTS_WKUPINT; // clear interrupt
        }
    }
}

bool STM32H7_UsbClient_StartOutput(USB_CONTROLLER_STATE* usbState, int32_t ep) {
    if (usbState == 0 || ep >= usbState->totalEndpointsCount)
        return false;

    OTG_TypeDef* OTG = OTG_FS;

    DISABLE_INTERRUPTS_SCOPED(irq);

    // If endpoint is not an output
    if (usbState->queues[ep] == 0 || !usbState->isTxQueue[ep])
        return false;

    /* if the halt feature for this endpoint is set, then just clear all the characters */
    if (usbState->endpointStatus[ep] & USB_STATUS_ENDPOINT_HALT) {
        TinyCLR_UsbClient_ClearEndpoints(usbState, ep);

        return true;
    }

    if (irq.IsDisabled()) { // check all endpoints for pending actions
        STM32H7_UsbClient_Interrupt((void *)OTG);
    }
    // write first packet if not done yet
    STM32H7_UsbClient_EndpointInInterrupt(OTG, usbState, ep);

    return true;
}

bool STM32H7_UsbClient_RxEnable(USB_CONTROLLER_STATE* usbState, int32_t ep) {
    // If this is not a legal Rx queue
    if (usbState == 0 || usbState->queues[ep] == 0 || usbState->isTxQueue[ep])
        return false;

