dobova86/TinyCLR_Port/Targets/STM32H7xx/STM32H7_USBC.cpp
    OTG_TypeDef* OTG = OTG_FS;

    DISABLE_INTERRUPTS_SCOPED(irq);

    // enable Rx
    if (!(OTG->DOEP[ep].CTL & OTG_DOEPCTL_EPENA)) {
        OTG->DOEP[ep].TSIZ = OTG_DOEPTSIZ_PKTCNT_1 | usbState->maxEndpointsPacketSize[ep];
        OTG->DOEP[ep].CTL |= OTG_DOEPCTL_EPENA | OTG_DOEPCTL_CNAK; // enable endpoint
    }

    return true;
}

void STM32H7_UsbClient_ProtectPins(int32_t controller, bool on) {
    USB_CONTROLLER_STATE *usbState = usbClientController[controller].usbState;

    OTG_TypeDef* OTG = OTG_FS;

    DISABLE_INTERRUPTS_SCOPED(irq);

    auto& dp = g_STM32H7_Usb_Dp_Pins[controller];
    auto& dm = g_STM32H7_Usb_Dm_Pins[controller];
    auto& id = g_STM32H7_Usb_Id_Pins[controller];

    if (on) {

        STM32H7_GpioInternal_ConfigurePin(dp.number, STM32H7_Gpio_PortMode::AlternateFunction, STM32H7_Gpio_OutputType::PushPull, STM32H7_Gpio_OutputSpeed::VeryHigh, STM32H7_Gpio_PullDirection::None, dp.alternateFunction);
        STM32H7_GpioInternal_ConfigurePin(dm.number, STM32H7_Gpio_PortMode::AlternateFunction, STM32H7_Gpio_OutputType::PushPull, STM32H7_Gpio_OutputSpeed::VeryHigh, STM32H7_Gpio_PullDirection::None, dm.alternateFunction);

        if (STM32H7_USB_USE_ID_PIN(controller)) {
            STM32H7_GpioInternal_ConfigurePin(id.number, STM32H7_Gpio_PortMode::AlternateFunction, STM32H7_Gpio_OutputType::PushPull, STM32H7_Gpio_OutputSpeed::VeryHigh, STM32H7_Gpio_PullDirection::None, id.alternateFunction);
        }

        // attach usb port
        OTG->DCTL &= ~OTG_DCTL_SDIS; // remove soft disconnect
    }
    else {
        // detach usb port
        OTG->DCTL |= OTG_DCTL_SDIS; // soft disconnect

        // clear USB Txbuffer
        for (int32_t ep = 1; ep < usbState->totalEndpointsCount; ep++) {
            if (usbState->queues[ep] && usbState->isTxQueue[ep]) {
                TinyCLR_UsbClient_ClearEndpoints(usbState, ep);
            }
        }

        STM32H7_GpioInternal_ClosePin(dp.number);
        STM32H7_GpioInternal_ClosePin(dm.number);

        if (STM32H7_USB_USE_ID_PIN(controller))
            STM32H7_GpioInternal_ClosePin(id.number);
    }

    usbState->deviceState = on ? USB_DEVICE_STATE_ATTACHED : USB_DEVICE_STATE_DETACHED;

    TinyCLR_UsbClient_StateCallback(usbState);
}

TinyCLR_Result TinyCLR_UsbClient_GetControllerCount(const TinyCLR_UsbClient_Provider* self, int32_t& count) {
    count = STM32H7_TOTAL_USB_CONTROLLERS;

    return TinyCLR_Result::Success;
}

bool TinyCLR_UsbClient_Initialize(USB_CONTROLLER_STATE* usbState) {	
    return STM32H7_UsbClient_Initialize(usbState);
}

bool TinyCLR_UsbClient_Uninitialize(USB_CONTROLLER_STATE* usbState) {
    return STM32H7_UsbClient_Uninitialize(usbState);
}

bool TinyCLR_UsbClient_StartOutput(USB_CONTROLLER_STATE* usbState, int32_t endpoint) {
    return STM32H7_UsbClient_StartOutput(usbState, endpoint);
}

bool TinyCLR_UsbClient_RxEnable(USB_CONTROLLER_STATE* usbState, int32_t endpoint) {
    return STM32H7_UsbClient_RxEnable(usbState, endpoint);
}

void TinyCLR_UsbClient_Delay(uint64_t microseconds) {
    STM32H7_Time_Delay(nullptr, microseconds);
}

void TinyCLR_UsbClient_InitializeConfiguration(USB_CONTROLLER_STATE *usbState) {
    STM32H7_UsbClient_InitializeConfiguration(usbState);
}

uint32_t TinyCLR_UsbClient_GetEndpointSize(int32_t endpoint) {
    return endpoint == 0 ? STM32H7_USB_ENDPOINT0_SIZE : STM32H7_USB_ENDPOINT_SIZE;
}

#ifdef OTG_USE_HS_ULPI
bool STM32H7_UsbClient_ProtectUlpiPins(int32_t controller, bool On)
{
	USB_CONTROLLER_STATE *usbState = usbClientController[controller].usbState;
	int i = 0;
	OTG_TypeDef* OTG = OTG_FS;

	//auto& dp = g_STM32H7_Usb_Dp_Pins[controller];
	//auto& dm = g_STM32H7_Usb_Dm_Pins[controller];
	//auto& id = g_STM32H7_Usb_Id_Pins[controller];


	DISABLE_INTERRUPTS_SCOPED(irq);


	if (On) {
		for (i = 0; i < TOTAL_ULPI_PINS; i++) {
			STM32H7_GpioInternal_ConfigurePin(g_STM32H7_Usb_Ulpi_Pins[i].number, STM32H7_Gpio_PortMode::AlternateFunction, STM32H7_Gpio_OutputType::PushPull, STM32H7_Gpio_OutputSpeed::VeryHigh, STM32H7_Gpio_PullDirection::None, g_STM32H7_Usb_Ulpi_Pins[i].alternateFunction);
		}
		OTG->DCTL &= ~OTG_DCTL_SDIS; // remove soft disconnect
	}
	else {

		OTG->DCTL |= OTG_DCTL_SDIS; // set soft disconnect
	   // clear USB Txbuffer
		for (int32_t ep = 1; ep < usbState->totalEndpointsCount; ep++) {
			if (usbState->queues[ep] && usbState->isTxQueue[ep]) {
				TinyCLR_UsbClient_ClearEndpoints(usbState, ep);
			}
		}

		//STM32H7_GpioInternal_ClosePin(dp.number);
		//STM32H7_GpioInternal_ClosePin(dm.number);

		//if (STM32H7_USB_USE_ID_PIN(controller))
		//	STM32H7_GpioInternal_ClosePin(id.number);
		for (i = 0; i < TOTAL_ULPI_PINS; i++) {
			STM32H7_GpioInternal_ClosePin(g_STM32H7_Usb_Ulpi_Pins[i].number);
		}
	}

	usbState->deviceState = On ? USB_DEVICE_STATE_ATTACHED : USB_DEVICE_STATE_DETACHED;
	TinyCLR_UsbClient_StateCallback(usbState);
	return true;

}
#endif

